docs/post/neovim_go/index.html
<!DOCTYPE html>
<html>
<head>	<meta charset="utf-8" />
	<meta http-equiv="X-UA-Compatible" content="IE=edge"><title>Go development setup with Neovim - Uday</title><meta name="viewport" content="width=device-width, initial-scale=1">
	<meta property="og:title" content="Go development setup with Neovim" />
<meta property="og:description" content="Before I start writing this post, I have a confession to make. I never thought I would be writing a post about an editor and it’s configuration, yet here I am writing about one of the most renowned editors, neovim. There are numerous posts about neovim and its configuration out there, but there is always scope for one more blog post.
 The goal of this post is to setup neovim for go development quickly; I won&#39;t go into detailing about each plugin and custom mappings." />
<meta property="og:type" content="article" />
<meta property="og:url" content="http://localhost:1313/post/neovim_go/" /><meta property="article:section" content="post" />
<meta property="article:published_time" content="2021-09-12T00:00:00+00:00" />
<meta property="article:modified_time" content="2021-09-12T00:00:00+00:00" />

<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="Go development setup with Neovim"/>
<meta name="twitter:description" content="Before I start writing this post, I have a confession to make. I never thought I would be writing a post about an editor and it’s configuration, yet here I am writing about one of the most renowned editors, neovim. There are numerous posts about neovim and its configuration out there, but there is always scope for one more blog post.
 The goal of this post is to setup neovim for go development quickly; I won&#39;t go into detailing about each plugin and custom mappings."/>
<link href="https://fonts.googleapis.com/css?family=Ubuntu:300,400,300italic,400italic|Raleway:200,300" rel="stylesheet">

	<link rel="stylesheet" type="text/css" media="screen" href="http://localhost:1313/css/normalize.css" />
	<link rel="stylesheet" type="text/css" media="screen" href="http://localhost:1313/css/main.css" />

	
</head>

<body>
	<div class="container wrapper post">
		<div class="header">
	<base href="http://localhost:1313/">
	<h1 class="site-title"><a href="http://localhost:1313/">Uday</a></h1>
	<div class="site-description"><nav class="nav social">
			<ul class="flat"></ul>
		</nav>
	</div>

	<nav class="nav">
		<ul class="flat">
			
		</ul>
	</nav>
</div>


		<div class="post-header">
			<h1 class="title">Go development setup with Neovim</h1>
			<div class="meta">Posted at &mdash; Sep 12, 2021</div>
		</div>

		<div class="markdown">
			
<p>
Before I start writing this post, I have a confession to make. I never thought I would be writing a post about
an editor and it’s configuration, yet here I am writing about one of the most renowned editors, <strong>neovim</strong>. There are numerous
posts about neovim and its configuration out there, but there is always scope for one more blog post.</p>
<p>
The goal of this post is to setup neovim for go development quickly; I won&#39;t go into detailing about each plugin and custom mappings.</p>
<p>
Though there is packer for managing packages in neovim, I stick with <strong>vim-plug</strong> for plugin management</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Steps
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<ul>
<li>
<p>Create configuration files with the following commands:</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#93a1a1;background-color:#002b36;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-shell" data-lang="shell">touch ~/.config/nvim/init.vim
touch ~/.config/nvim/mappings.vim
touch ~/.config/nvim/plugins.vim
touch ~/.config/nvim/nerdtree.vim
mkdir -p lua/config
touch ~/.config/nvim/lua/config/telescope.lua
touch ~/.config/nvim/lua/config/golsp.lua</code></pre></div>
</div>
</li>
<li>
<p>Contents of ~/.config/nvim/init.vim</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#93a1a1;background-color:#002b36;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-shell" data-lang="shell"><span style="color:#b58900">source</span> ~/.config/nvim/plugins.vim
<span style="color:#b58900">source</span> ~/.config/nvim/mappings.vim
<span style="color:#b58900">source</span> ~/.config/nvim/nerdtree.vim</code></pre></div>
</div>
</li>
<li>
<p>Contents of ~/.config/nvim/plugins.vim</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#93a1a1;background-color:#002b36;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-shell" data-lang="shell">  call plug#begin<span style="color:#719e07">(</span><span style="color:#2aa198">&#39;~/.config/nvim/plugged&#39;</span><span style="color:#719e07">)</span>
  Plug <span style="color:#2aa198">&#39;scrooloose/nerdtree&#39;</span>
  Plug <span style="color:#2aa198">&#39;junegunn/fzf&#39;</span>, <span style="color:#719e07">{</span> <span style="color:#2aa198">&#39;do&#39;</span>: <span style="color:#719e07">{</span> -&gt; fzf#install<span style="color:#719e07">()</span> <span style="color:#719e07">}</span> <span style="color:#719e07">}</span>
  Plug <span style="color:#2aa198">&#39;junegunn/fzf.vim&#39;</span>
  Plug <span style="color:#2aa198">&#39;vim-airline/vim-airline&#39;</span>
  Plug <span style="color:#2aa198">&#39;vim-airline/vim-airline-themes&#39;</span>
  Plug <span style="color:#2aa198">&#39;tpope/vim-fugitive&#39;</span>
  Plug <span style="color:#2aa198">&#39;airblade/vim-gitgutter&#39;</span>
  Plug <span style="color:#2aa198">&#39;chriskempson/base16-vim&#39;</span>
  Plug <span style="color:#2aa198">&#39;nvim-lua/popup.nvim&#39;</span>
  Plug <span style="color:#2aa198">&#39;nvim-lua/plenary.nvim&#39;</span>
  Plug <span style="color:#2aa198">&#39;nvim-telescope/telescope.nvim&#39;</span>
  Plug <span style="color:#2aa198">&#39;neovim/nvim-lspconfig&#39;</span>
  Plug <span style="color:#2aa198">&#39;nvim-treesitter/nvim-treesitter&#39;</span>, <span style="color:#719e07">{</span><span style="color:#2aa198">&#39;do&#39;</span>: <span style="color:#2aa198">&#39;:TSUpdate&#39;</span><span style="color:#719e07">}</span>
  Plug <span style="color:#2aa198">&#39;simrat39/symbols-outline.nvim&#39;</span>
  Plug <span style="color:#2aa198">&#39;ray-x/lsp_signature.nvim&#39;</span>
  Plug <span style="color:#2aa198">&#39;ms-jpq/coq_nvim&#39;</span>, <span style="color:#719e07">{</span><span style="color:#2aa198">&#39;branch&#39;</span>: <span style="color:#2aa198">&#39;coq&#39;</span><span style="color:#719e07">}</span>
  Plug <span style="color:#2aa198">&#39;ms-jpq/coq.artifacts&#39;</span>, <span style="color:#719e07">{</span><span style="color:#2aa198">&#39;branch&#39;</span>: <span style="color:#2aa198">&#39;artifacts&#39;</span><span style="color:#719e07">}</span>
  call plug#end<span style="color:#719e07">()</span></code></pre></div>
</div>
</li>
<li>
<p>Contents of ~/.config/nvim/mappings.vim</p>
</li>
</ul>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#93a1a1;background-color:#002b36;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-shell" data-lang="shell"><span style="color:#b58900">let</span> <span style="color:#268bd2">mapleader</span><span style="color:#719e07">=</span><span style="color:#2aa198">&#34;\&lt;space&gt;&#34;</span>

<span style="color:#b58900">set</span> nu rnu
<span style="color:#b58900">set</span> <span style="color:#268bd2">tabstop</span><span style="color:#719e07">=</span><span style="color:#2aa198">2</span> <span style="color:#268bd2">softtabstop</span><span style="color:#719e07">=</span><span style="color:#2aa198">0</span> expandtab <span style="color:#268bd2">shiftwidth</span><span style="color:#719e07">=</span><span style="color:#2aa198">2</span> smarttab

map &lt;C-s&gt; :w&lt;CR&gt;
imap &lt;C-s&gt; &lt;Esc&gt;:w&lt;CR&gt;i

<span style="color:#b58900">let</span> g:coq_settings <span style="color:#719e07">=</span> <span style="color:#719e07">{</span> <span style="color:#2aa198">&#39;auto_start&#39;</span>: v:true <span style="color:#719e07">}</span>

:lua vim.o.completeopt <span style="color:#719e07">=</span> <span style="color:#2aa198">&#39;menuone,noselect&#39;</span>
autocmd BufWritePre *.go lua gofmt<span style="color:#719e07">(</span>1000<span style="color:#719e07">)</span></code></pre></div>
</div>
<ul>
<li>
<p>Contents of ~/.config/nvim/nerdtree.vim</p>
</li>
</ul>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#93a1a1;background-color:#002b36;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-shell" data-lang="shell"> nnoremap &lt;C-n&gt; :NERDTreeToggle&lt;CR&gt;
 <span style="color:#b58900">let</span> g:NERDTreeWinPos <span style="color:#719e07">=</span> <span style="color:#2aa198">&#34;right&#34;</span></code></pre></div>
</div>
<ul>
<li>
<p>Contents of ~/.config/nvim/lua/config/telescope.lua</p>
</li>
</ul>
<div class="src src-lua">
<div class="highlight"><pre tabindex="0" style="color:#93a1a1;background-color:#002b36;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-lua" data-lang="lua">require<span style="color:#2aa198">&#39;telescope&#39;</span>.setup {
preview_cutoff <span style="color:#719e07">=</span> <span style="color:#2aa198">5</span>
}

<span style="color:#268bd2">local</span> opts <span style="color:#719e07">=</span> {}

<span style="color:#586e75">-- See `:help vim.lsp.*` for documentation on any of the below functions</span>
<span style="color:#268bd2">local</span> keymap <span style="color:#719e07">=</span> vim.api.nvim_set_keymap
keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;leader&gt;ff&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua require(&#34;telescope.builtin&#34;).find_files()&lt;cr&gt;&#39;</span>, opts)
keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;leader&gt;fg&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua require(&#34;telescope.builtin&#34;).live_grep()&lt;cr&gt;&#39;</span>, opts)
keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;leader&gt;fb&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua require(&#34;telescope.builtin&#34;).buffers()&lt;cr&gt;&#39;</span>, opts)
keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;leader&gt;fh&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua require(&#34;telescope.builtin&#34;).help_tags()&lt;cr&gt;&#39;</span>, opts)</code></pre></div>
</div>
<ul>
<li>
<p>Contents of ~/.config/nvim/lua/config/golsp.lua</p>
</li>
</ul>
<div class="src src-lua">
<div class="highlight"><pre tabindex="0" style="color:#93a1a1;background-color:#002b36;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-lua" data-lang="lua"><span style="color:#268bd2">local</span> nvim_lsp <span style="color:#719e07">=</span> require <span style="color:#2aa198">&#39;lspconfig&#39;</span>
<span style="color:#268bd2">local</span> coq <span style="color:#719e07">=</span> require <span style="color:#2aa198">&#34;coq&#34;</span>

<span style="color:#586e75">-- Use an on_attach function to only map the following keys</span>
<span style="color:#586e75">-- after the language server attaches to the current buffer</span>
<span style="color:#268bd2">local</span> on_attach <span style="color:#719e07">=</span>  <span style="color:#268bd2">function</span>(client, bufnr)
<span style="color:#268bd2">local</span> <span style="color:#268bd2">function</span> <span style="color:#268bd2">buf_set_keymap</span>(...) vim.api.nvim_buf_set_keymap(bufnr, ...) <span style="color:#268bd2">end</span>
<span style="color:#268bd2">local</span> <span style="color:#268bd2">function</span> <span style="color:#268bd2">buf_set_option</span>(...) vim.api.nvim_buf_set_option(bufnr, ...) <span style="color:#268bd2">end</span>

<span style="color:#586e75">--Enable completion triggered by &lt;c-x&gt;&lt;c-o&gt;</span>
buf_set_option(<span style="color:#2aa198">&#39;omnifunc&#39;</span>, <span style="color:#2aa198">&#39;v:lua.vim.lsp.omnifunc&#39;</span>)

<span style="color:#586e75">-- Mappings.</span>
<span style="color:#268bd2">local</span> opts <span style="color:#719e07">=</span> { noremap<span style="color:#719e07">=</span><span style="color:#cb4b16">true</span>, silent<span style="color:#719e07">=</span><span style="color:#cb4b16">false</span> }
<span style="color:#586e75">-- local opts = {}</span>

<span style="color:#586e75">-- See `:help vim.lsp.*` for documentation on any of the below functions</span>
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;gD&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.declaration()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;gd&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.definition()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;K&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.hover()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;gi&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.implementation()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;C-k&gt;&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.signature_help()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;space&gt;wa&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.add_workspace_folder()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;space&gt;wr&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.remove_workspace_folder()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;space&gt;wl&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua print(vim.inspect(vim.lsp.buf.list_workspace_folders()))&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;space&gt;D&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.type_definition()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;space&gt;rn&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.rename()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;space&gt;ca&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.code_action()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;gr&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.references()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;space&gt;e&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.diagnostic.show_line_diagnostics()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;[d&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.diagnostic.goto_prev()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;]d&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.diagnostic.goto_next()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;space&gt;q&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.diagnostic.set_loclist()&lt;CR&gt;&#39;</span>, opts)
buf_set_keymap(<span style="color:#2aa198">&#39;n&#39;</span>, <span style="color:#2aa198">&#39;&lt;space&gt;f&#39;</span>, <span style="color:#2aa198">&#39;&lt;cmd&gt;lua vim.lsp.buf.formatting()&lt;CR&gt;&#39;</span>, opts)

require <span style="color:#2aa198">&#39;lsp_signature&#39;</span>.on_attach({
  bind <span style="color:#719e07">=</span> <span style="color:#cb4b16">true</span>,
  zindex <span style="color:#719e07">=</span> <span style="color:#2aa198">200</span>,
  doc_lines <span style="color:#719e07">=</span> <span style="color:#2aa198">0</span>
}, bufnr)

<span style="color:#268bd2">end</span>

<span style="color:#586e75">-- Use a loop to conveniently call &#39;setup&#39; on multiple servers and</span>
<span style="color:#586e75">-- map buffer local keybindings when the language server attaches</span>
nvim_lsp.gopls.setup( 
coq.lsp_ensure_capabilities({
on_attach <span style="color:#719e07">=</span> on_attach,
cmd <span style="color:#719e07">=</span> {<span style="color:#2aa198">&#34;gopls&#34;</span>},
settings <span style="color:#719e07">=</span> {
  analyses <span style="color:#719e07">=</span> {
    unusedparams <span style="color:#719e07">=</span> <span style="color:#cb4b16">true</span>,
  },
  staticcheck <span style="color:#719e07">=</span> <span style="color:#cb4b16">true</span>,
  usePlaceholders <span style="color:#719e07">=</span> <span style="color:#cb4b16">true</span>,
  gofumpt <span style="color:#719e07">=</span> <span style="color:#cb4b16">true</span>,
}
})
)



<span style="color:#268bd2">function</span> <span style="color:#268bd2">gofmt</span>(timeout_ms)
goimports(timeout_ms)
vim.lsp.buf.formatting()
<span style="color:#268bd2">end</span>


<span style="color:#268bd2">function</span> <span style="color:#268bd2">goimports</span>(timeout_ms)
  <span style="color:#268bd2">local</span> context <span style="color:#719e07">=</span> { only <span style="color:#719e07">=</span> { <span style="color:#2aa198">&#34;source.organizeImports&#34;</span> } }
  vim.validate { context <span style="color:#719e07">=</span> { context, <span style="color:#2aa198">&#34;t&#34;</span>, <span style="color:#cb4b16">true</span> } }

  <span style="color:#268bd2">local</span> params <span style="color:#719e07">=</span> vim.lsp.util.make_range_params()
  params.context <span style="color:#719e07">=</span> context

  <span style="color:#586e75">-- See the implementation of the textDocument/codeAction callback</span>
  <span style="color:#586e75">-- (lua/vim/lsp/handler.lua) for how to do this properly.</span>
  <span style="color:#268bd2">local</span> result <span style="color:#719e07">=</span> vim.lsp.buf_request_sync(<span style="color:#2aa198">0</span>, <span style="color:#2aa198">&#34;textDocument/codeAction&#34;</span>, params, timeout_ms)
  <span style="color:#268bd2">if</span> <span style="color:#719e07">not</span> result <span style="color:#719e07">or</span> next(result) <span style="color:#719e07">==</span> <span style="color:#cb4b16">nil</span> <span style="color:#268bd2">then</span> <span style="color:#268bd2">return</span> <span style="color:#268bd2">end</span>
  <span style="color:#268bd2">local</span> actions <span style="color:#719e07">=</span> result[<span style="color:#2aa198">1</span>].result
  <span style="color:#268bd2">if</span> <span style="color:#719e07">not</span> actions <span style="color:#268bd2">then</span> <span style="color:#268bd2">return</span> <span style="color:#268bd2">end</span>
  <span style="color:#268bd2">local</span> action <span style="color:#719e07">=</span> actions[<span style="color:#2aa198">1</span>]

  <span style="color:#586e75">-- textDocument/codeAction can return either Command[] or CodeAction[]. If it</span>
  <span style="color:#586e75">-- is a CodeAction, it can have either an edit, a command or both. Edits</span>
  <span style="color:#586e75">-- should be executed first.</span>
  <span style="color:#268bd2">if</span> action.edit <span style="color:#719e07">or</span> type(action.command) <span style="color:#719e07">==</span> <span style="color:#2aa198">&#34;table&#34;</span> <span style="color:#268bd2">then</span>
    <span style="color:#268bd2">if</span> action.edit <span style="color:#268bd2">then</span>
      vim.lsp.util.apply_workspace_edit(action.edit)
    <span style="color:#268bd2">end</span>
    <span style="color:#268bd2">if</span> type(action.command) <span style="color:#719e07">==</span> <span style="color:#2aa198">&#34;table&#34;</span> <span style="color:#268bd2">then</span>
      vim.lsp.buf.execute_command(action.command)
    <span style="color:#268bd2">end</span>
  <span style="color:#268bd2">else</span>
    vim.lsp.buf.execute_command(action)
  <span style="color:#268bd2">end</span>
<span style="color:#268bd2">end</span></code></pre></div>
</div>
<p>
Once you have all the files ready</p>
<ul>
<li>
<p>Open neovim</p>
</li>
<li>
<p>type :PlugInstall</p>
</li>
<li>
<p>type :COQdeps</p>
</li>
</ul>
<p>Now, you should be ready for go development in neovim.</p>
<p>
Couple of shortcuts to get you started:</p>
<ul>
<li>
<p>&lt;Ctrl&gt; + n : Opens file browser</p>
</li>
<li>
<p>&lt;Space&gt; + ff : Search for a file</p>
</li>
</ul>
</div>
</div>

		</div>

		<div class="post-tags">
			
				
			
		</div>
		</div>
	<div class="footer wrapper">
	<nav class="nav">
		<div> <a href="https://github.com/vividvilla/ezhil">Ezhil theme</a> | Built with <a href="https://gohugo.io">Hugo</a></div>
	</nav>
</div>


</body>
</html>
